/*
 * Lib_A_DIFF_differentiators.c
 *
 *  Created on: 2 февр. 2018 г.
 *      Author: m.isaev
 */



/******************************************************************************/
// 	Секция include: здесь подключается заголовочный файл к модулю
#include "Lib_A_DIFF_differentiators.h"
/******************************************************************************/


/******************************************************************************/
/*============================================================================*/
// 	Глобальные переменные
/*============================================================================*/


/*============================================================================*/
// 	Локальные переменные
/*============================================================================*/
/******************************************************************************/


/******************************************************************************/
// 	Секция прототипов локальных функций
/******************************************************************************/


/******************************************************************************/
// 	Секция описания функций (сначала глобальных, потом локальных)
float DIFF_FindDifferent1(
                          DIFF_differentiator_1_s *pStruct,
                          float value)
{
	//	Дифференцирование методом 1-го порядка;
	float diff = (value - pStruct->preValue) / pStruct->dT;

	//	Копирование текущего значения в переменную для хранения значения за
	//	шаг <t-1>;
	pStruct->preValue = value;

	//	Возврат дифференцировванного значения;
	return diff;
}

float DIFF_FindDifferent2(DIFF_differentiator_2_s *pStruct, float value)
{
	float diff;
	if (pStruct->cnt == 0)
	{
		pStruct->cnt++;
//		pStruct->preValue2 = value;
	}
	else if (pStruct->cnt == 1)
	{
		diff = (value - pStruct->preValue2) / pStruct->dT * 2;
		pStruct->preValue2 = value;
		pStruct->cnt = 0;
		return diff;
	}

}
/*============================================================================*/

/*============================================================================*/
/******************************************************************************/


////////////////////////////////////////////////////////////////////////////////
// 	END OF FILE
////////////////////////////////////////////////////////////////////////////////
