/*
 * Lib_A_DIFF_differentiators.h
 *
 *  Created on: 2 февр. 2018 г.
 *      Author: m.isaev
 */

#ifndef LIB_A_DIFF_DIFFERENTIATORS_H_
#define LIB_A_DIFF_DIFFERENTIATORS_H_


/******************************************************************************/
//  Секция include (подключаем заголовочные файлы используемых модулей)
/*============================================================================*/
//  Стандартные библиотеки языка С
#include <stdint.h>
#include <stdio.h>
#include <stdbool.h>
#include <string.h>
/*============================================================================*/


/*============================================================================*/
//  Библиотеки для работы с периферией микроконтроллера
/*============================================================================*/


/*============================================================================*/
//  Внешние модули
/*============================================================================*/
/******************************************************************************/


/******************************************************************************/
//  Секция определения констант
/******************************************************************************/


/******************************************************************************/
//  Секция определения типов
/**
 * @brief	Структура содержит поля для функции, выполняющей фифференцирование
 *  		методом 1-го порядка;
 */
typedef struct
{
	/**
	 * @brief	Период дифференцирования;
	 */
	float dT;

	/**
	 * @brief	Значение дифференцируемой переменной на предыдущем шаге;
	 */
	float preValue;
} DIFF_differentiator_1_s;
/******************************************************************************/


/******************************************************************************/
//  Секция определения глобальных переменных
extern float DIFF_FindDifferent1
(DIFF_differentiator_1_s *pStruct,
        float value);
/******************************************************************************/


/******************************************************************************/
//  Секция прототипов глобальных функций
/******************************************************************************/


/******************************************************************************/
//  Секция определения макросов
/******************************************************************************/
#endif /* LIB_A_DIFF_DIFFERENTIATORS_H_ */

////////////////////////////////////////////////////////////////////////////////
//  END OF FILE
////////////////////////////////////////////////////////////////////////////////
